// Вывести на экран число пи с точностью до сотых

double pi = Math.PI;
Console.WriteLine("{0:0.00}", pi);